cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-drivers"

brew "fish"
brew "git"
brew "lazygit"
brew "neovim"
brew "tmux"
brew "anyenv"
brew "mas"
brew "exa"
brew "peco"
brew "ghq"
brew "curl"
brew "wget"
brew "reattach-to-user-namespace"
brew "tree-sitter"
brew "ripgrep"
brew "fd"
brew "ninja"
brew "lua-language-server"

cask "google-chrome"
cask "firefox"
cask "slack"
cask "zoom"
cask "iterm2"
cask "webstorm"
cask "visual-studio-code"
cask "docker"
cask "postman"
cask "karabiner-elements"
cask "clipy"
cask "appcleaner"
cask "philips-hue-sync"
cask "kindle"
cask "astro-command-center"

mas "LINE", id: 539883307
mas "Messenger", id: 1480068668
mas "The Unarchiver", id: 425424353

tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
